gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.4
*   Platform             : CORTEXM
*   Peripheral           : ADC
*   Dependencies         : none
*
*   Autosar Version      : 4.4.0
*   Autosar Revision     : ASR_REL_4_4_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 1.0.0
*   Build Version        : S32K1_RTD_1_0_0_D2108_ASR_REL_4_4_REV_0000_20210810
*
*   (c) Copyright 2020-2021 NXP Semiconductors
*   All Rights Reserved.
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

/**
*   @file
*
*   @addtogroup adc_ip Adc IPL
*   @{
*/

#include "Adc_Ip.h"
#include "Adc_Ip_HwAccess.h"
#include "SchM_Adc.h"
#include "OsIf.h"

#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
#include "Devassert.h"
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
/* USER_MODE_REG_PROT_ENABLED is defined for Base sanity check in RegLockMacros.h */
#define USER_MODE_REG_PROT_ENABLED      (ADC_IP_ENABLE_USER_MODE_SUPPORT)
#include "RegLockMacros.h"
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */

/*******************************************************************************
 *   Source file version information
 ******************************************************************************/
#define ADC_IP_VENDOR_ID_C                      43
#define ADC_IP_AR_RELEASE_MAJOR_VERSION_C       4
#define ADC_IP_AR_RELEASE_MINOR_VERSION_C       4
#define ADC_IP_AR_RELEASE_REVISION_VERSION_C    0
#define ADC_IP_SW_MAJOR_VERSION_C               1
#define ADC_IP_SW_MINOR_VERSION_C               0
#define ADC_IP_SW_PATCH_VERSION_C               0

/*******************************************************************************
 *   File version checks
 ******************************************************************************/
/* Check if Adc_Ip.c file and Adc_Ip.h file are of the same vendor */
#if (ADC_IP_VENDOR_ID_C != ADC_IP_VENDOR_ID_H)
    #error "Adc_Ip.c and Adc_Ip.h have different vendor ids"
#endif

/* Check if Adc_Ip.c file and Adc_Ip.h file are of the same Autosar version */
#if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != ADC_IP_AR_RELEASE_MAJOR_VERSION_H) || \
     (ADC_IP_AR_RELEASE_MINOR_VERSION_C != ADC_IP_AR_RELEASE_MINOR_VERSION_H) || \
     (ADC_IP_AR_RELEASE_REVISION_VERSION_C != ADC_IP_AR_RELEASE_REVISION_VERSION_H) \
    )
    #error "AutoSar Version Numbers of Adc_Ip.c and Adc_Ip.h are different"
#endif

/* Check if Adc_Ip.c file and Adc_Ip.h file are of the same Software version */
#if ((ADC_IP_SW_MAJOR_VERSION_C != ADC_IP_SW_MAJOR_VERSION_H) || \
     (ADC_IP_SW_MINOR_VERSION_C != ADC_IP_SW_MINOR_VERSION_H) || \
     (ADC_IP_SW_PATCH_VERSION_C != ADC_IP_SW_PATCH_VERSION_H) \
    )
  #error "Software Version Numbers of Adc_Ip.c and Adc_Ip.h are different"
#endif

/* Check if Adc_Ip.c file and Adc_Ip_HwAccess.h file are of the same vendor */
#if (ADC_IP_VENDOR_ID_C != ADC_IP_VENDOR_ID_HWACCESS_H)
    #error "Adc_Ip.c and Adc_Ip_HwAccess.h have different vendor ids"
#endif

/* Check if Adc_Ip.c file and Adc_Ip_HwAccess.h file are of the same Autosar version */
#if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != ADC_IP_AR_RELEASE_MAJOR_VERSION_HWACCESS_H) || \
     (ADC_IP_AR_RELEASE_MINOR_VERSION_C != ADC_IP_AR_RELEASE_MINOR_VERSION_HWACCESS_H) || \
     (ADC_IP_AR_RELEASE_REVISION_VERSION_C != ADC_IP_AR_RELEASE_REVISION_VERSION_HWACCESS_H) \
    )
    #error "AutoSar Version Numbers of Adc_Ip.c and Adc_Ip_HwAccess.h are different"
#endif

/* Check if Adc_Ip.c file and Adc_Ip_HwAccess.h file are of the same Software version */
#if ((ADC_IP_SW_MAJOR_VERSION_C != ADC_IP_SW_MAJOR_VERSION_HWACCESS_H) || \
     (ADC_IP_SW_MINOR_VERSION_C != ADC_IP_SW_MINOR_VERSION_HWACCESS_H) || \
     (ADC_IP_SW_PATCH_VERSION_C != ADC_IP_SW_PATCH_VERSION_HWACCESS_H) \
    )
  #error "Software Version Numbers of Adc_Ip.c and Adc_Ip_HwAccess.h are different"
#endif

#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
/* Check if Adc_Ip.c file and OsIf.h file are of the same Autosar version */
#if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != OSIF_AR_RELEASE_MAJOR_VERSION) || \
        (ADC_IP_AR_RELEASE_MINOR_VERSION_C != OSIF_AR_RELEASE_MINOR_VERSION)    \
    )
    #error "AutoSar Version Numbers of Adc_Ip.c and OsIf.h are different"
#endif

#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    /* Checks against RegLockMacros.h */
    #if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != REGLOCKMACROS_AR_RELEASE_MAJOR_VERSION) || \
         (ADC_IP_AR_RELEASE_MINOR_VERSION_C != REGLOCKMACROS_AR_RELEASE_MINOR_VERSION))
        #error "AutoSar Version Numbers of Adc_Ip.c and RegLockMacros.h are different"
    #endif
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */

/* Check if Adc_Ip.c and SchM_Adc.h are of the same Autosar version */
#if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != SCHM_ADC_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_IP_AR_RELEASE_MINOR_VERSION_C != SCHM_ADC_AR_RELEASE_MINOR_VERSION) \
    )
#error "AutoSar Version Numbers of Adc_Ip.c and SchM_Adc.h are different"
#endif

#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
/* Check if Adc_Ip.c and Devassert.h are of the same Autosar version */
#if ((ADC_IP_AR_RELEASE_MAJOR_VERSION_C != DEVASSERT_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_IP_AR_RELEASE_MINOR_VERSION_C != DEVASSERT_AR_RELEASE_MINOR_VERSION) \
    )
    #error "AutoSar Version Numbers of Adc_Ip.c and Devassert.h are different"
#endif
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */
#endif /* DISABLE_MCAL_INTERMODULE_ASR_CHECK */

