gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
/*******************************************************************************
 * Pre-check
 ******************************************************************************/
#ifndef MCAL_ENABLE_USER_MODE_SUPPORT
    #if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
        #error MCAL_ENABLE_USER_MODE_SUPPORT is not enabled. For running ADC in user mode the MCAL_ENABLE_USER_MODE_SUPPORT needs to be defined
    #endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
#endif /* ifndef MCAL_ENABLE_USER_MODE_SUPPORT */

/*******************************************************************************
 * Local function prototypes
 ******************************************************************************/
#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
static void ADC_SetSupplyMonitoringEnable_TrustedCall(const boolean SupplyEnable);
static void ADC_SetSupplyMonitoringEnable(const boolean SupplyEnable);
static void ADC_ConfigSupplyMonitoringChannel_TrustedCall(const uint32 SupplyChannel);
static void ADC_ConfigSupplyMonitoringChannel(const uint32 SupplyChannel);
static void ADC_ResetSupplyMonitoringChannel_TrustedCall(void);
static void ADC_ResetSupplyMonitoringChannel(void);
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */
#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
static void ADC_SetTriggerSourceSelect_TrustedCall(const uint32 Instance, const uint8 TriggerSource);
static void ADC_SetTriggerSourceSelect(const uint32 Instance, const uint8 TriggerSource);
static void ADC_SetPretriggerSourceSelect_TrustedCall(const uint32 Instance, const uint8 PretriggerSource);
static void ADC_SetPretriggerSourceSelect(const uint32 Instance, const uint8 PretriggerSource);
static void ADC_SetSoftwarePretrigger_TrustedCall(const uint32 Instance, const uint8 SoftwarePretrigger);
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */

#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"
/*******************************************************************************
 * Variables
 ******************************************************************************/
#define ADC_START_SEC_CONST_UNSPECIFIED
#include "Adc_MemMap.h"

/* Table of Base addresses for ADC instances. */
static ADC_Type * const AdcBase[ADC_INSTANCE_COUNT] = IP_ADC_BASE_PTRS;

#define ADC_STOP_SEC_CONST_UNSPECIFIED
#include "Adc_MemMap.h"

#define ADC_START_SEC_VAR_CLEARED_UNSPECIFIED
#include "Adc_MemMap.h"
/* Global state structure */
static Adc_Ip_StateStructType AdcIpState[ADC_INSTANCE_COUNT];

#define ADC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
#include "Adc_MemMap.h"

#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

/*FUNCTION**********************************************************************
*
* Function Name : Adc_DoCalibration_SetParams
* Description   : This function configures averaging, sample time, input clock and trigger
* mode for Adc_Ip_DoCalibration service.
*
* END**************************************************************************/
static inline void Adc_DoCalibration_SetParams(ADC_Type * const Base, const Adc_Ip_ClockConfigType * const Config, const Adc_Ip_TrigType TriggerMode);

static inline void Adc_DoCalibration_SetParams(ADC_Type * const Base, const Adc_Ip_ClockConfigType * const Config, const Adc_Ip_TrigType TriggerMode)
{
    /* Configure averaging */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_29();
    Adc_HwAcc_SetAveraging(Base, Config->AvgEn, Config->AvgSel);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_29();

    /* Configure trigger mode */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_24();
    Adc_HwAcc_SetTriggerMode(Base, TriggerMode);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_24();

    /* Configure sample time */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_15();
    Adc_HwAcc_SetSampleTime(Base, Config->SampleTime);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_15();

    /* Configure input clock */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_13();
    Adc_HwAcc_SetClock(Base, Config->ClockDivide, Config->InputClock);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_13();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_Init
* Description   : This function initializes the ADC module by configuring all
* available features.
*
* @implements     Adc_Ip_Init_Activity
* END**************************************************************************/
void Adc_Ip_Init(const uint32 Instance, const Adc_Ip_ConfigType * const Config)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(Config != NULL_PTR);
    DevAssert(Config->NumChannels <= ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    uint32 SC2Reg = 0u;
    uint32 SC2ClearMask = 0u;
    uint8 Index;

    Adc_HwAcc_SetClock(Base, Config->ClockDivide, Config->InputClock);
    Adc_HwAcc_SetSampleTime(Base, Config->SampleTime);
    Adc_HwAcc_SetAveraging(Base, Config->AvgEn, Config->AvgSel);

    Adc_Ip_SetResolution(Instance, Config->Resolution);

#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
    ADC_SetTriggerSourceSelect(Instance, Config->TriggerSel);
    ADC_SetPretriggerSourceSelect(Instance, Config->PretriggerSel);
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */

#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    if (Instance == 0U)
    {
        ADC_SetSupplyMonitoringEnable(Config->SupplyMonitoringEnable);
    }
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */

    /* Configure trigger mode */
    SC2ClearMask |= ADC_SC2_ADTRG_MASK;
    SC2Reg |= ADC_SC2_ADTRG(Config->TriggerMode);

    /* Configure DMA enable */
    if (Config->DmaEnable)
    {
        SC2Reg |= ADC_SC2_DMAEN_MASK;
    }
    else
    {
        SC2ClearMask |= ADC_SC2_DMAEN_MASK;
    }

    /* Configure voltage reference selector */
    SC2ClearMask |= ADC_SC2_REFSEL_MASK;
    SC2Reg |= ADC_SC2_REFSEL(Config->VoltageRef);

    /* Configure compare enables and values */
    SC2ClearMask |= ADC_SC2_ACFE_MASK | ADC_SC2_ACFGT_MASK | ADC_SC2_ACREN_MASK;
    SC2Reg |= ADC_SC2_ACFE(Config->CompareEnable ? 1u : 0u);
    SC2Reg |= ADC_SC2_ACFGT(Config->CompareGreaterThanEnable ? 1u : 0u);
    SC2Reg |= ADC_SC2_ACREN(Config->CompareRangeFuncEnable ? 1u : 0u);
    Base->CV[0u] = ADC_CV_CV(Config->CompVal1);
    Base->CV[1u] = ADC_CV_CV(Config->CompVal2);

    Adc_HwAcc_SetSC2Reg(Base, SC2ClearMask, SC2Reg);

