gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
    Adc_HwAcc_SetUserGainAndOffset(Base, Config->UsrGain, Config->UsrOffset);

    Adc_Ip_SetContinuousMode(Instance, Config->ContinuousConvEnable);

    if (Config->ChannelConfigs != NULL_PTR)
    {
        for (Index = 0u; Index < Config->NumChannels; Index++)
        {
            Adc_Ip_ConfigChannel(Instance, &(Config->ChannelConfigs[Index]));
        }
    }

    AdcIpState[Instance].ConversionCompleteNotification = Config->ConversionCompleteNotification;
    AdcIpState[Instance].CalibrationClockDivide = Config->CalibrationClockDivide;
    AdcIpState[Instance].Init = TRUE;
#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
    AdcIpState[Instance].PretriggerSel = Config->PretriggerSel;
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_DeInit
* Description   : This function resets the ADC internal registers to default values.
*
* @implements     Adc_Ip_Deinit_Activity
* END**************************************************************************/
void Adc_Ip_DeInit(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    Adc_Ip_ConfigType DefaultConfig;
    Adc_Ip_ChanConfigType ChannelConfigs[ADC_MAX_CHAN_COUNT];
    uint8 Index;

    DefaultConfig.ClockDivide = ADC_IP_CLK_FULL_BUS;
    DefaultConfig.CalibrationClockDivide = ADC_IP_CLK_EIGHTH_BUS;
    DefaultConfig.InputClock = ADC_IP_CLK_ALT_1;
    DefaultConfig.SampleTime = ADC_IP_DEFAULT_SAMPLE_TIME;
    DefaultConfig.AvgEn = FALSE;
    DefaultConfig.AvgSel = ADC_IP_AVG_4_CONV;
    DefaultConfig.Resolution = ADC_IP_RESOLUTION_8BIT;
    DefaultConfig.TriggerMode = ADC_IP_TRIGGER_SOFTWARE;
#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
    DefaultConfig.PretriggerSel = ADC_IP_PRETRIGGER_SEL_PDB;
    DefaultConfig.TriggerSel = ADC_IP_TRIGGER_SEL_PDB;
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */
    DefaultConfig.DmaEnable = FALSE;
    DefaultConfig.VoltageRef = ADC_IP_VOLTAGEREF_VREF;
    DefaultConfig.ContinuousConvEnable = FALSE;
#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    DefaultConfig.SupplyMonitoringEnable = FALSE;
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */
    DefaultConfig.CompareEnable = FALSE;
    DefaultConfig.CompareGreaterThanEnable = FALSE;
    DefaultConfig.CompareRangeFuncEnable = FALSE;
    DefaultConfig.CompVal1 = 0u;
    DefaultConfig.CompVal2 = 0u;
    DefaultConfig.UsrGain = ADC_IP_DEFAULT_USER_GAIN;
    DefaultConfig.UsrOffset = 0u;
    DefaultConfig.NumChannels = ADC_MAX_CHAN_COUNT;
    for (Index = 0u; Index < ADC_MAX_CHAN_COUNT; Index++)
    {
        ChannelConfigs[Index].ChnIdx = Index;
        ChannelConfigs[Index].Channel = ADC_IP_INPUTCHAN_DISABLED;
        ChannelConfigs[Index].InterruptEnable = FALSE;
    }
    DefaultConfig.ChannelConfigs = ChannelConfigs;
    DefaultConfig.ConversionCompleteNotification = NULL_PTR;

    Adc_Ip_Init(Instance, &DefaultConfig);
#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    if (Instance == 0U)
    {
        ADC_ResetSupplyMonitoringChannel();
    }
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */

    AdcIpState[Instance].Init = FALSE;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetAveraging
* Description   : This function enables averaging and selects the number of 
* conversions to average.
* The mask parameter should be set using the Adc_Ip_AvgSelectType enum elements
* that have the pattern ADC_IP_AVG_... e.g. ADC_IP_AVG_4_CONV.
*
* @implements     Adc_Ip_SetAveraging_Activity
* END**************************************************************************/
void Adc_Ip_SetAveraging(const uint32 Instance, const boolean AvgEn, const Adc_Ip_AvgSelectType AvgSel)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_27();
    Adc_HwAcc_SetAveraging(Base, AvgEn, AvgSel);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_27();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetSampleTime
* Description   : This function sets the sample time for selected ADC instance.
*
* @implements     Adc_Ip_SetSampleTime_Activity
* END**************************************************************************/
void Adc_Ip_SetSampleTime(const uint32 Instance, const uint8 SampleTime)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_16();
    Adc_HwAcc_SetSampleTime(Base, SampleTime);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_16();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_EnableDma
* Description   : This function enables DMA.
*
* @implements     Adc_Ip_EnableDma_Activity
* END**************************************************************************/
void Adc_Ip_EnableDma(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_26();
    Base->SC2 |= ADC_SC2_DMAEN_MASK;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_26();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_DisableDma
* Description   : This function disables DMA.
*
* @implements     Adc_Ip_DisableDma_Activity
* END**************************************************************************/
void Adc_Ip_DisableDma(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_22();
    Base->SC2 &= ~(ADC_SC2_DMAEN_MASK);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_22();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetTriggerMode
* Description   : This function enables either hardware or software trigger.
*
* @implements     Adc_Ip_SetTriggerMode_Activity
* END**************************************************************************/
void Adc_Ip_SetTriggerMode(const uint32 Instance, const Adc_Ip_TrigType TriggerMode)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_23();
    Adc_HwAcc_SetTriggerMode(Base, TriggerMode);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_23();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetContinuousMode
* Description   : This function switches between ADC continuous conversion mode 
* and one shot mode.
*
* @implements     Adc_Ip_SetContinuousMode_Activity
* END**************************************************************************/
void Adc_Ip_SetContinuousMode(const uint32 Instance, const boolean ContinuousModeEnable)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_30();
    uint32 Sc3Reg = Base->SC3;
    Sc3Reg &= ~(ADC_SC3_ADCO_MASK);
    Sc3Reg |= ADC_SC3_ADCO(ContinuousModeEnable ? 1u : 0u);
    Base->SC3 = Sc3Reg;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_30();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetResolution
* Description   : This function sets ADC module resolution.
*
* @implements     Adc_Ip_SetResolution_Activity
* END**************************************************************************/
void Adc_Ip_SetResolution(const uint32 Instance, const Adc_Ip_ResolutionType Resolution)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_10();
    uint32 Cfg1Reg = Base->CFG1;
    Cfg1Reg &= ~(ADC_CFG1_MODE_MASK);
    Cfg1Reg |= ADC_CFG1_MODE(Resolution);
    Base->CFG1 = Cfg1Reg;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_10();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetClockMode
* Description   : This function initializes the ADC clock configuration.
*
* @implements     Adc_Ip_SetClockMode_Activity
* END**************************************************************************/
void Adc_Ip_SetClockMode(const uint32 Instance, const Adc_Ip_ClockConfigType * const Config)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(Config != NULL_PTR);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

