gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
    Adc_HwAcc_SetClock(Base, Config->ClockDivide, Config->InputClock);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_14();
    Adc_HwAcc_SetSampleTime(Base, Config->SampleTime);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_14();

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_28();
    Adc_HwAcc_SetAveraging(Base, Config->AvgEn, Config->AvgSel);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_ConfigChannel
* Description   : Configures the selected control channel with the given
* configuration structure.
*
* When Software Trigger mode is enabled, configuring control channel index 0,
* implicitly triggers a new conversion on the selected ADC input channel.
* Therefore, Adc_Ip_ConfigChannel can be used for sw-triggering conversions.
*
* Configuring any control channel while it is actively controlling a conversion
* (sw or hw triggered) will implicitly abort the on-going conversion.
*
* @implements     Adc_Ip_ConfigChannel_Activity
* END**************************************************************************/
void Adc_Ip_ConfigChannel(const uint32 Instance, const Adc_Ip_ChanConfigType * const ChanConfig)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ChanConfig != NULL_PTR);
#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    DevAssert((Instance == 0u) || ((uint32)ChanConfig->Channel < (uint32)ADC_IP_INPUTCHAN_SUPPLY_VDD));
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    Adc_Ip_InputChannelType InputChanDemapped;

#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    /* Internal supply monitor channels need special configuration */
    if (ChanConfig->Channel >= ADC_IP_INPUTCHAN_SUPPLY_VDD)
    {
        /* De-map ADC_IP_INPUTCHAN_SUPPLY_ into actual index. */
        const uint32 SupplyChannel = (uint32)ChanConfig->Channel - (uint32)ADC_IP_INPUTCHAN_SUPPLY_VDD;
        ADC_ConfigSupplyMonitoringChannel(SupplyChannel);
        /* Supply monitor channels are measured on ADC internal input channel 0 */
        InputChanDemapped = ADC_IP_INPUTCHAN_INT0;
    }
    else
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */
    {
        InputChanDemapped = ChanConfig->Channel;
    }

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_21();
    Adc_HwAcc_SetChannel(Base, ChanConfig->ChnIdx, InputChanDemapped, ChanConfig->InterruptEnable);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_21();

    /* Also update in state structure */
    AdcIpState[Instance].ChannelConfig[ChanConfig->ChnIdx] = ChanConfig->Channel;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetDisabledChannel
* Description   : This function sets the input channel of the selected control 
* channel to ADC_IP_INPUTCHAN_DISABLED. If WithTimeout is TRUE then the 
* function will also wait for the register to be updated.
* Note: the control channel index is the numeric index of SC1x 
* (e.g. SC1A has index 0), not the input channel.
*
* @implements     Adc_Ip_SetDisabledChannel_Activity
* END**************************************************************************/
Adc_Ip_StatusType Adc_Ip_SetDisabledChannel(const uint32 Instance, const uint8 ControlChanIdx, const boolean WithTimeout)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    Adc_Ip_StatusType Status = ADC_IP_STATUS_SUCCESS;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_IP_TIMEOUT_VAL, ADC_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_17();
    /* Set input channel select to disabled */
    SC1(Base, ControlChanIdx) |= ADC_SC1_ADCH_MASK;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_17();

    if (WithTimeout == TRUE)
    {
        while (((SC1(Base, ControlChanIdx) & ADC_SC1_ADCH_MASK) != ADC_SC1_ADCH_MASK) && (ElapsedTicks < TimeoutTicks))
        {
            ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_IP_TIMEOUT_TYPE);
        }
        if (ElapsedTicks >= TimeoutTicks)
        {
            Status = ADC_IP_STATUS_TIMEOUT;
        }
    }

    return Status;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_StartConversion
* Description   : This function starts a software conversion on the selected 
* input channel by writing the given values to the SC1A register.
* The result can be read with Adc_Ip_GetConvData with index 0.
* Note: hardware configuration on the control channel with index 0 will be 
* overwritten.
* Note: this will not work if hardware triggered mode is selected.
*
* @implements     Adc_Ip_StartConversion_Activity
* END**************************************************************************/
void Adc_Ip_StartConversion(const uint32 Instance, Adc_Ip_InputChannelType InputChannel, const boolean InterruptEnable)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_18();
    /* Configure SC1A register */
    Adc_HwAcc_SetChannel(Base, 0u, InputChannel, InterruptEnable);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_18();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetConvActiveFlag
* Description   : Reads and return conversion active flag status.
*
* @implements     Adc_Ip_GetConvActiveFlag_Activity
* END**************************************************************************/
boolean Adc_Ip_GetConvActiveFlag(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

