gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
    const ADC_Type * const Base = AdcBase[Instance];
    uint32 Sc2Reg = Base->SC2;

    Sc2Reg = (Sc2Reg & ADC_SC2_ADACT_MASK) >> ADC_SC2_ADACT_SHIFT;

    return (Sc2Reg != 0u) ? TRUE : FALSE;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetChanInterrupt
* Description   :  This function checks and returns if the selected control 
* channel has the interrupt flag set.
*
* @implements     Adc_Ip_GetChanInterrupt_Activity
* END**************************************************************************/
boolean Adc_Ip_GetChanInterrupt(const uint32 Instance, const uint8 ControlChanIdx)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    const ADC_Type * const Base = AdcBase[Instance];
    const uint32 Sc1Reg = SC1(Base, ControlChanIdx);

    return Adc_HwAcc_GetAIEN(Sc1Reg);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetConvCompleteFlag
* Description   :  This function returns the value of the conversion 
* complete(COCO) flag of a given channel.
*
* @implements     Adc_Ip_GetConvCompleteFlag_Activity
* END**************************************************************************/
boolean Adc_Ip_GetConvCompleteFlag(const uint32 Instance, const uint8 ControlChanIdx)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    const ADC_Type * const Base = AdcBase[Instance];
    const uint32 Sc1Reg = SC1(Base, ControlChanIdx);

    return Adc_HwAcc_GetCOCO(Sc1Reg);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetConvData
* Description   : This function retrieves the last conversion result for the 
* selected control channel. This function does no validity check on the result. 
* In order to check if the result is valid, the user must call 
* Adc_Ip_GetConvCompleteFlag function before this one.
*
* @implements     Adc_Ip_GetConvData_Activity
* END**************************************************************************/
uint16 Adc_Ip_GetConvData(const uint32 Instance, const uint8 ControlChanIdx)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    const ADC_Type * const Base = AdcBase[Instance];

    return Adc_HwAcc_GetData(Base, ControlChanIdx);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_DoCalibration
* Description   : This function performs a calibration of the ADC. The input
* clock frequency for calibration must be less than or equal to half of the maximum
* specified frequency (50Mhz) and greater than minimum specified frequency (20Mhz).
*
* @implements     Adc_Ip_DoCalibration_Activity
* END**************************************************************************/
Adc_Ip_StatusType Adc_Ip_DoCalibration(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    Adc_Ip_StatusType Status = ADC_IP_STATUS_SUCCESS;
    Adc_Ip_TrigType TriggerMode;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_IP_TIMEOUT_VAL, ADC_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;
    uint32 Reg;
    Adc_Ip_ClockConfigType PreClockConfig;
    Adc_Ip_ClockConfigType CalClockConfig;

    /* Store settings before calibration */
    Reg = Base->SC3;
    PreClockConfig.AvgEn = ((Reg & ADC_SC3_AVGE_MASK) != 0u) ? TRUE : FALSE;
    PreClockConfig.AvgSel = Adc_HwAcc_GetAverageSelect(Reg);

    Reg = Base->CFG2;
    PreClockConfig.SampleTime = (uint8) ((Reg & ADC_CFG2_SMPLTS_MASK) >> ADC_CFG2_SMPLTS_SHIFT);
    TriggerMode = Adc_HwAcc_GetTriggerMode(Base->SC2);

    Reg = Base->CFG1;
    PreClockConfig.ClockDivide = Adc_HwAcc_GetClockDivide(Reg);
    PreClockConfig.InputClock = Adc_HwAcc_GetInputClock(Reg);

    CalClockConfig.AvgEn = TRUE;
    CalClockConfig.AvgSel = ADC_IP_AVG_32_CONV;
    CalClockConfig.SampleTime = ADC_IP_DEFAULT_SAMPLE_TIME;
    CalClockConfig.ClockDivide = AdcIpState[Instance].CalibrationClockDivide;
    CalClockConfig.InputClock = PreClockConfig.InputClock;

    /* Prepare required settings for calibration. */
    Adc_DoCalibration_SetParams(Base, &CalClockConfig, ADC_IP_TRIGGER_SOFTWARE);

    Base->CLPS = 0u;
    Base->CLP3 = 0u;
    Base->CLP2 = 0u;
    Base->CLP1 = 0u;
    Base->CLP0 = 0u;
    Base->CLPX = 0u;
    Base->CLP9 = 0u;

    /* Start calibration by writing to the calibration field */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_29();
    Reg = Base->SC3;
    Reg &= ~(ADC_SC3_CAL_MASK);
    Reg |= ADC_SC3_CAL(1u);
    Base->SC3 = Reg;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_29();

    /* Wait for the calibration to finish */
    while (((Base->SC3 & ADC_SC3_CAL_MASK) != 0u) && (ElapsedTicks < TimeoutTicks))
    {
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_IP_TIMEOUT_TYPE);
    }
    if (ElapsedTicks >= TimeoutTicks)
    {
        Status = ADC_IP_STATUS_TIMEOUT;
    }

    /* Revert settings as same as before calibration. */
    Adc_DoCalibration_SetParams(Base, &PreClockConfig, TriggerMode);

    /* Clear COCO flag */
    (void) R(Base, 0u);

    return Status;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_ClearLatchedTriggers
* Description   : This function clears all trigger latched flags of the ADC instance.
* This function must be called after the hardware trigger source for the ADC 
* has been deactivated.
*
* @implements     Adc_Ip_ClearLatchedTriggers_Activity
* END**************************************************************************/
Adc_Ip_StatusType Adc_Ip_ClearLatchedTriggers(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(Instance != 0u);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    Adc_Ip_StatusType Status = ADC_IP_STATUS_SUCCESS;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_IP_TIMEOUT_VAL, ADC_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
    /* Write bit to clear latched triggers */
    Base->CFG1 |= ADC_CFG1_CLRLTRG(0x01u);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

    /* Wait for latched triggers to be cleared */
    while (((Base->SC2 & ADC_SC2_TRGSTLAT_MASK) != 0u) && (ElapsedTicks < TimeoutTicks))
    {
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_IP_TIMEOUT_TYPE);
    }
    if (ElapsedTicks >= TimeoutTicks)
    {
        Status = ADC_IP_STATUS_TIMEOUT;
    }

