gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
    return Status;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_EnableChannelNotification
* Description   : This function enables the notification for the selected channel.
* Note          : It's required to read result data in user notification in order to clear the COCO flags and avoid ISR getting invoked repeatedly
*
* @implements     Adc_Ip_EnableChannelNotification_Activity
* END**************************************************************************/
void Adc_Ip_EnableChannelNotification(const uint32 Instance, const uint8 ControlChanIdx)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_19();
    SC1(Base, ControlChanIdx) |= ADC_SC1_AIEN_MASK;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_19();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_DisableChannelNotification
* Description   : This function disables the notification for the selected channel.
*
* @implements     Adc_Ip_DisableChannelNotification_Activity
* END**************************************************************************/
void Adc_Ip_DisableChannelNotification(const uint32 Instance, const uint8 ControlChanIdx)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(ControlChanIdx < ADC_MAX_CHAN_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
    SC1(Base, ControlChanIdx) &= ~(ADC_SC1_AIEN_MASK);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_ClearTrigErrReg
* Description   : This function clears all trigger error flags of the ADC instance.
*
* @implements     Adc_Ip_ClearTrigErrReg_Activity
* END**************************************************************************/
void Adc_Ip_ClearTrigErrReg(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(Instance != 0u);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    ADC_Type * const Base = AdcBase[Instance];
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_25();
    Base->SC2 |= ADC_SC2_TRGSTERR_MASK;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_25();
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetTrigErrReg
* Description   : This function returns all trigger error flags of the ADC instance.
*
* @implements     Adc_Ip_GetTrigErrReg_Activity
* END**************************************************************************/
uint32 Adc_Ip_GetTrigErrReg(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    DevAssert(Instance != 0u);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    const ADC_Type * const Base = AdcBase[Instance];

    return (Base->SC2 & ADC_SC2_TRGSTERR_MASK) >> ADC_SC2_TRGSTERR_SHIFT;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Ip_GetDataAddress
 * Description   : Returns the address of the specified Rn register.
 *
 * @implements     Adc_Ip_GetDataAddress_Activity
 *END*************************************************************************/
uint32 Adc_Ip_GetDataAddress(const uint32 Instance, const uint8 Index)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */
    return (uint32)&(R(AdcBase[Instance], Index));
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_GetChanData
* Description   : This function retrieves the last conversion result for the
* selected input channel, by looking which control channel was configured
* with it. If multiple control channels are configured simultaneously with
* the same requested input channel, the result of the first control channel
* found will be returned. If no control channel is configured with the given
* input channel then ADC_IP_STATUS_ERROR will be returned.
* This function does no validity check on the result.
* In order to check if the result is valid, the user must call
* Adc_Ip_GetConvCompleteFlag function before this one.
*
* @implements     Adc_Ip_GetChanData_Activity
* END**************************************************************************/
Adc_Ip_StatusType Adc_Ip_GetChanData(const uint32 Instance, const Adc_Ip_InputChannelType Channel, uint16 * const Result)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
    DevAssert((Instance == 0u) || ((uint32)Channel < (uint32)ADC_IP_INPUTCHAN_SUPPLY_VDD));
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    const ADC_Type * const Base = AdcBase[Instance];
    Adc_Ip_StatusType Status = ADC_IP_STATUS_SUCCESS;
    uint16 Temp = 0u;
    uint8 ControlChanIdx;
    boolean Found = FALSE;

    for (ControlChanIdx = 0u; ControlChanIdx < ADC_MAX_CHAN_COUNT; ControlChanIdx++)
    {
        if (AdcIpState[Instance].ChannelConfig[ControlChanIdx] == Channel)
        {
            Found = TRUE;
            break;
        }
    }

    if (Found == TRUE)
    {
        Temp = (uint16) R(Base, ControlChanIdx);
        Temp = (uint16) ((Temp & ADC_R_D_MASK) >> ADC_R_D_SHIFT);
    }
    else
    {
        Status = ADC_IP_STATUS_ERROR;
    }

    *Result = Temp;

    return Status;
}

#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Ip_SetSoftwarePretrigger
* Description   : This function sets the software pretrigger source for 
* an ADC instance.
*
* @implements     Adc_Ip_SetSoftwarePretrigger_Activity
* END**************************************************************************/
void Adc_Ip_SetSoftwarePretrigger(const uint32 Instance, const Adc_Ip_SoftwarePretriggerType SoftwarePretrigger)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
    /* If SW Pretrigger Select is not enabled, the SW pretriggers will be ignored by ADC. */
    DevAssert(AdcIpState[Instance].PretriggerSel == ADC_IP_PRETRIGGER_SEL_SW);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call2params(ADC_SetSoftwarePretrigger_TrustedCall, Instance, (uint8)SoftwarePretrigger);
#else
    ADC_SetSoftwarePretrigger_TrustedCall(Instance, (uint8)SoftwarePretrigger);
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Ip_IRQHandler
 * Description   : Handles Adc interrupts.
 * Note          : It's required to read result data in user notification in order to clear the COCO flags and avoid ISR getting invoked repeatedly
 *
 * @implements     Adc_Ip_IRQHandler_Activity
 *END*************************************************************************/
/* The IAR build wants to see function prototypes */
void Adc_Ip_IRQHandler(const uint32 Instance);

void Adc_Ip_IRQHandler(const uint32 Instance)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_INSTANCE_COUNT);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

