gettobyte/GB_ElecronicsV_S32K144_Autosar_MCAL/Peripherals/ADC/GB_ADC_TRGMUX_Demo/RTD/src/Adc_Ip.c
    const ADC_Type * const Base = AdcBase[Instance];
    uint32 Sc1Reg;
    uint8 ControlChanIdx;
    boolean ChanIntFlag = FALSE;
    boolean ChanCocoFlag = FALSE;

    /* NOTE: CPR_RTD_00028 wasn't fulfilled in because ISR cannot distinguish if an interrupt is spurious or if conversion was initiated on purpose with AIEN = 0
    * The reasons are:
    *  - There is a single interrupt line for all COCO flags
    *  - It is a valid usecase to have COCO flag set but AIEN=0 (e.g. in HLD only interrupt for last channel in group is enabled)
    *  - Clearing of COCO flag is only done by reading the result register - COCO is not w1c
    */

    /* Check if the Adc unit is initialized and if the interrupt is not NULL 
     * first since all channels use the same callback */
    if ((AdcIpState[Instance].Init == TRUE) && 
        (AdcIpState[Instance].ConversionCompleteNotification != NULL_PTR))
    {
        for (ControlChanIdx = 0u; ControlChanIdx < ADC_MAX_CHAN_COUNT; ControlChanIdx++)
        {
            Sc1Reg = SC1(Base, ControlChanIdx);
            ChanIntFlag = Adc_HwAcc_GetAIEN(Sc1Reg);
            ChanCocoFlag = Adc_HwAcc_GetCOCO(Sc1Reg);
            /* Check if the interrupt was spurrios by checking if the interrupt 
             * is enabled and equivalent conversion has finished */
            if ((TRUE == ChanIntFlag) && (TRUE == ChanCocoFlag))
            {
                AdcIpState[Instance].ConversionCompleteNotification(ControlChanIdx);
            }
            else if ((ADC_IP_INPUTCHAN_DISABLED == AdcIpState[Instance].ChannelConfig[ControlChanIdx]) && (TRUE == ChanCocoFlag))
            {
                /* This will only clear the obvious spurious COCO flags. If the flag will be spuriously set on active channels it will not be caught by this. */
                (void)Adc_HwAcc_GetData(Base, ControlChanIdx);
            }
            else
            {
                ; /* Empty else branch to avoid MISRA */
            }
        }
    }
    else
    {
        for (ControlChanIdx = 0u; ControlChanIdx < ADC_MAX_CHAN_COUNT; ControlChanIdx++)
        {
            /* Do a dummy read to clear the COCO flags */
            (void)Adc_HwAcc_GetData(Base, ControlChanIdx);
        }
    }
}

#if (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON)
static void ADC_SetSupplyMonitoringEnable_TrustedCall(const boolean SupplyEnable)
{
    /* Set or clear ADC_SUPPLY field of CHIPCTL register from SIM based on SupplyEnable */
    if (SupplyEnable == TRUE)
    {
        IP_SIM->CHIPCTL |= SIM_CHIPCTL_ADC_SUPPLYEN_MASK;
    }
    else
    {
        IP_SIM->CHIPCTL &= ~SIM_CHIPCTL_ADC_SUPPLYEN_MASK;
    }
}

/*FUNCTION**********************************************************************
*
* Function Name : ADC_SetSupplyMonitoringEnable
* Description   : This function enable supply monitoring for the internal channels
* on SIM registers
*
* END**************************************************************************/
static void ADC_SetSupplyMonitoringEnable(const boolean SupplyEnable)
{
#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call1param(ADC_SetSupplyMonitoringEnable_TrustedCall, SupplyEnable);
#else
    ADC_SetSupplyMonitoringEnable_TrustedCall(SupplyEnable);
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}

static void ADC_ConfigSupplyMonitoringChannel_TrustedCall(const uint32 SupplyChannel)
{
#if (ADC_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert((IP_SIM->CHIPCTL & SIM_CHIPCTL_ADC_SUPPLYEN_MASK) != 0UL);
#endif /* (ADC_IP_DEV_ERROR_DETECT == STD_ON) */

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_32();
    uint32 Reg = IP_SIM->CHIPCTL;
    Reg &= ~SIM_CHIPCTL_ADC_SUPPLY_MASK;
    Reg |= SIM_CHIPCTL_ADC_SUPPLY(SupplyChannel);
    IP_SIM->CHIPCTL = Reg;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_32();
}

/*FUNCTION**********************************************************************
*
* Function Name : ADC_ConfigSupplyMonitoringChannel
* Description   : This function configures the internal channels on on SIM registers
*
* END**************************************************************************/
static void ADC_ConfigSupplyMonitoringChannel(const uint32 SupplyChannel)
{
#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call1param(ADC_ConfigSupplyMonitoringChannel_TrustedCall, SupplyChannel);
#else
    ADC_ConfigSupplyMonitoringChannel_TrustedCall(SupplyChannel);
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}

static void ADC_ResetSupplyMonitoringChannel_TrustedCall(void)
{
    /* Clear ADC supply mask from CHIPCTL of SIM register */
    IP_SIM->CHIPCTL &= ~SIM_CHIPCTL_ADC_SUPPLY_MASK;
}

/*FUNCTION**********************************************************************
*
* Function Name : ADC_ResetSupplyMonitoringChannel
* Description   : This function resets the muxing for ADC channel on SIM register to reset value
*
* END**************************************************************************/
static void ADC_ResetSupplyMonitoringChannel(void)
{
#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call(ADC_ResetSupplyMonitoringChannel_TrustedCall);
#else
    ADC_ResetSupplyMonitoringChannel_TrustedCall();
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}
#endif /* (ADC_IP_SUPPLY_MONITORING_ENABLED == STD_ON) */

#if (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON)
/*FUNCTION**********************************************************************
*
* Function Name : ADC_SetTriggerSourceSelect
* Description   : This function selects trigger source for an ADC instance
*
* END**************************************************************************/
static void ADC_SetTriggerSourceSelect(const uint32 Instance, const uint8 TriggerSource)
{
#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call2params(ADC_SetTriggerSourceSelect_TrustedCall, Instance, TriggerSource);
#else
    ADC_SetTriggerSourceSelect_TrustedCall(Instance, TriggerSource);
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}

static void ADC_SetTriggerSourceSelect_TrustedCall(const uint32 Instance, const uint8 TriggerSource)
{
    uint32 Reg = (uint32)IP_SIM->ADCOPT;

#if (ADC_INSTANCE_COUNT > 1u)
    switch (Instance)
    {
        case 0u:
        {
#endif /* (ADC_INSTANCE_COUNT > 1u) */
            Reg &= ~SIM_ADCOPT_ADC0TRGSEL_MASK;
            Reg |= SIM_ADCOPT_ADC0TRGSEL(TriggerSource);
#if (ADC_INSTANCE_COUNT > 1u)
            break;
        }
        case 1u:
        {
            Reg &= ~SIM_ADCOPT_ADC1TRGSEL_MASK;
            Reg |= SIM_ADCOPT_ADC1TRGSEL(TriggerSource);
            break;
        }
        default:
        {
            ; /* no-op */
            break;
        }
    }
#else
    (void)Instance;
#endif /* (ADC_INSTANCE_COUNT > 1u) */
    IP_SIM->ADCOPT = Reg;
}

/*FUNCTION**********************************************************************
*
* Function Name : ADC_SetPretriggerSourceSelect
* Description   : This function selects pretrigger source for an ADC instance
*
* END**************************************************************************/
static void ADC_SetPretriggerSourceSelect(const uint32 Instance, const uint8 PretriggerSource)
{
#if (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT)
    OsIf_Trusted_Call2params(ADC_SetPretriggerSourceSelect_TrustedCall, Instance, PretriggerSource);
#else
    ADC_SetPretriggerSourceSelect_TrustedCall(Instance, PretriggerSource);
#endif /* (STD_ON == ADC_IP_ENABLE_USER_MODE_SUPPORT) */
}

static void ADC_SetPretriggerSourceSelect_TrustedCall(const uint32 Instance, const uint8 PretriggerSource)
{
    uint32 Reg = (uint32)IP_SIM->ADCOPT;

#if (ADC_INSTANCE_COUNT > 1u)
    switch (Instance)
    {
        case 0u:
        {
#endif /* (ADC_INSTANCE_COUNT > 1u) */
            Reg &= ~SIM_ADCOPT_ADC0PRETRGSEL_MASK;
            Reg |= SIM_ADCOPT_ADC0PRETRGSEL(PretriggerSource);
#if (ADC_INSTANCE_COUNT > 1u)
            break;
        }
        case 1u:
        {
            Reg &= ~SIM_ADCOPT_ADC1PRETRGSEL_MASK;
            Reg |= SIM_ADCOPT_ADC1PRETRGSEL(PretriggerSource);
            break;
        }
        default:
        {
            ; /* no-op */
            break;
        }
    }
#else
    (void)Instance;
#endif /* (ADC_INSTANCE_COUNT > 1u) */
    IP_SIM->ADCOPT = Reg;
}

/*FUNCTION**********************************************************************
*
* Function Name : ADC_SetSoftwarePretrigger_TrustedCall
* Description   : This function writes the software pretrigger source to be 
* configured for an ADC instance
*
* END**************************************************************************/
static void ADC_SetSoftwarePretrigger_TrustedCall(const uint32 Instance, const uint8 SoftwarePretrigger)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_31();
    uint32 Reg = (uint32)IP_SIM->ADCOPT;

#if (ADC_INSTANCE_COUNT > 1u)
    switch (Instance)
    {
        case 0u:
        {
#endif /* (ADC_INSTANCE_COUNT > 1u) */
            Reg &= ~SIM_ADCOPT_ADC0SWPRETRG_MASK;
            Reg |= SIM_ADCOPT_ADC0SWPRETRG(SoftwarePretrigger);
#if (ADC_INSTANCE_COUNT > 1u)
            break;
        }
        case 1u:
        {
            Reg &= ~SIM_ADCOPT_ADC1SWPRETRG_MASK;
            Reg |= SIM_ADCOPT_ADC1SWPRETRG(SoftwarePretrigger);
            break;
        }
        default:
        {
            ; /* no-op */
            break;
        }
    }
#else
    (void)Instance;
#endif /* (ADC_INSTANCE_COUNT > 1u) */
    IP_SIM->ADCOPT = Reg;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_31();
}
#endif /* (ADC_IP_ENABLE_SIM_SOURCE_SELECTION == STD_ON) */


#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

/** @} */
